<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"envs/dev/eu-central-1/demo","backend":"4bea49574b5ad366514331d39ab22a84fc77b8055228ed75d7e513d7760eee77","plan_job_ref":"Job TF plan & apply envs/dev/eu-central-1/demo terraform files #6 at https://github.com/ishuar/tfskel-demo/actions/runs/22511986335","plan_out_hash":"115563f20d11ccc6a1366336aec2cb831b4f56c117c14fac841b38397c90326c","plan_hash":"3875045b4d06bf84e73609e11b4f4006a9b5aa0d6adbf05338d344ec0c0a94c8","plan_text_format":"diff","version":"2.2.3"} -->
Terraform plan for __envs/dev/eu-central-1/demo__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.tfskel_demo will be created
+   resource "aws_s3_bucket" "tfskel_demo" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "my-demo-dev-euc1-bucket"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "eu-central-1"
+       request_payer               = (known after apply)
+       tags                        = {
+           "Name" = "my-demo-dev-euc1-bucket"
        }
+       tags_all                    = {
+           "Name"       = "my-demo-dev-euc1-bucket"
+           "app"        = "demo"
+           "env"        = "dev"
+           "managed_by" = "terraform"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:orange_circle: Applying plan in [TF plan & apply envs/dev/eu-central-1/demo terraform files #6](https://github.com/ishuar/tfskel-demo/actions/runs/22511986335)